reddit_clone/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(name: username)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "donald"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "YGLUIraG0QR4pj7BSbPA3A"], ["updated_at", "2020-08-24 18:57:54.012087"], ["id", 1]]